// todo: Сохраните результат шахматной партии в виде двухмерного массива board, называть фигуры можно 
// произвольно, например “black queen”.

let board = [[],[],[],[],[],[],[],[]]

board[0][0] = 'чладья'
board[0][2] = 'чслон'
board[0][3] = 'чкороль'
board[0][7] = 'чладья'
board[1][0] = 'чпешка'
board[1][3] = 'чпешка'
board[1][4] = 'бслон'
board[1][5] = 'чпешка'
board[1][6] = 'бконь'
board[1][7] = 'бпешка'
board[2][0] = 'чконь'
board[2][5] = 'чконь'
board[3][1] = 'чпешка'
board[3][3] = 'бконь'
board[3][4] = 'бпешка'
board[3][7] = 'бпешка'
board[4][6] = 'бпешка'
board[5][3] = 'бпешка'
board[6][0] = 'бпешка'
board[6][2] = 'бпешка'
board[6][4] = 'бкороль'
board[7][0] = 'бкоролева'
board[7][6] = 'бслон'

console.log(board)
